def encode_to_morse(text):
    morze = {"A": ".-",
             "B": "-...",
             "W": ".--",
             "G": "--.",
             "D": "-..",
             "E": ".",
             "V": "...-",
             "Z": "--..",
             "I": "..",
             "J": ".---",
             "K": "-.-",
             "L": ".-..",
             "M": "--",
             "N": "-.",
             "O": "---",
             "P": ".--.",
             "R": ".-.",
             "S": "...",
             "T": "-",
             "U": "..-",
             "F": "..-.",
             "H": "....",
             "C": "-.-.",
             "Q": "--.-",
             "Y": "-..-",
             "X": "-.--",
             "’": "",
             ",": "",
             ".": "",
             "_": " ",
             " ": "/"}
    text = text.upper()
    a = []
    for i in text:
        a.append(morze[i])
    a = " ".join(a)
    print(a)


def decode_from_morse(code):
    morze = {".-": "A",
             "-...": "B",
             ".--": "W",
             "--.": "G",
             "-..": "D",
             ".": "E",
             "...-": "V",
             "--..": "Z",
             "..": "I",
             ".---": "J",
             "-.-": "K",
             ".-..": "L",
             "--": "M",
             "-.": "N",
             "---": "O",
             ".--.": "P",
             ".-.": "R",
             "...": "S",
             "-": "T",
             "..-": "U",
             "..-.": "F",
             "....": "H",
             "-.-.": "C",
             "--.-": "Q",
             "-..-": "Y",
             "-.--": "X",
             "": " ",
             "/": " "}
    code = code.split(" ")
    a = []
    for i in code:
        a.append(morze[i])
    a = "".join(a)
    print(a.replace("  ", " "))


print("Введите текст или морзе для кодирования")
s = input()
if s[0] == ".":
    decode_from_morse(s)
elif s[0] == "-":
    decode_from_morse(s)
else:
    encode_to_morse(s)
