


ingredients = [0, 442334, 88203842]
print(choose_coffee("Эспрессо", "Капучино", "Маккиато", "Кофе по-венски",
                    "Латте Маккиато", "Кон Панна"))
print(choose_coffee("Эспрессо", "Капучино", "Маккиато", "Кофе по-венски",
                    "Латте Маккиато", "Кон Панна"))
print("")
print("")
ingredients = [4, 4, 0]
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
